/**
  ******************************************************************************
  * @author  Nydxsst
  * @version V1.0.0
  * @date    2020/01/24
  ******************************************************************************
	* @attention 
  ******************************************************************************
  */

#ifndef __LED_H
#define __LED_H

#include "gd32e10x.h"


/* LED操作线 -----------------------------------------------------------------*/
#define SYSTEM_LED				PBout(2)
#define SYSTEM_LED_CLK		RCU_GPIOB
#define SYSTEM_LED_PORT		GPIOB
#define SYSTEM_LED_PIN		GPIO_PIN_2


/* 外部调用函数 --------------------------------------------------------------*/
void Led_Init(void);

#endif
