/**
  ******************************************************************************
  * @author  
  * @version V1.0.0
  * @date    2020/05/14
  ******************************************************************************
	* @attention 
	* Delay函数不能在中断中使用！
	* 在中断里延时有两个方法：
	* 1.专门开一个定时器给这个中断延时
	*   (如果一个定时器给多个中断延时,要考虑到是否会有冲突)
	* 2.上操作系统
  ******************************************************************************
  */

#ifndef __DELAY_H
#define __DELAY_H

#include "stm32f10x.h"


/* 外部调用函数 --------------------------------------------------------------*/
void Delay_Init(void);
void Delay_Ms(u16 nms);// >1864溢出
void Delay_Us(u32 nus);

#endif


